views/site/index.php

        <div class="col-12 col-sm-6 col-md-6">
            <?= \hail812\adminlte\widgets\InfoBox::widget([
                'text' => 'Admin',
                'number' => \app\models\User::find()->where(['role' => 'admin'])->count(),
---
SELECT COUNT(*) FROM `user` WHERE `role`='admin'

        <div class="col-12 col-sm-6 col-md-6">
            <?= \hail812\adminlte\widgets\InfoBox::widget([
                'text' => 'User',
                'number' => \app\models\User::find()->where(['role' => 'user'])->count(),
---
SELECT COUNT(*) FROM `user` WHERE `role`='user'

            <div class="col-12 col-sm-6 col-md-6">
                <?= \hail812\adminlte\widgets\InfoBox::widget([
                    'text' => 'Tổng số tài khoản',
                    'number' => \app\models\User::find()->count(),
---
SELECT COUNT(*) FROM `user`

            <?php echo $this->render('chart'); ?>
        </div>
        <div class="col-md-4 col-sm-6 col-12">
            <?php $smallBox = \hail812\adminlte\widgets\SmallBox::begin([
                'title' => \app\models\Products::find()->count() . ' sản phẩm',
                'text' => \app\models\base\Categories::find()->count() . ' phân loại',
                'icon' => 'fas fa-shopping-cart',
            ]) ?>
---
SELECT COUNT(*) FROM `products`
SELECT COUNT(*) FROM `categories`