models/Products.php

SELECT * FROM `categories`
---
    public static function getCate()
    {
        $cate = Categories::find()->all();

SELECT * FROM `categories`
---
    public static function getAllCategories()
    {
        $cate = Categories::find()->all();

SELECT COUNT(*) FROM `products`
SELECT * FROM `categories`
SELECT COUNT(*) FROM `products` WHERE `category_id`=1
---
    public static function getPercentCate(){
        $total = Products::find()->count();
        $cates = Categories::find()->all();
        $result = [];
        foreach ($cates as $cate){
            $products = Products::find()->where(['category_id' => $cate->id])->count();