models/User.php

    public static function findIdentity($id)
    {
//        return isset(self::$users[$id]) ? new static(self::$users[$id]) : null;
        return self::findOne($id);
---
SELECT * FROM `user` WHERE `id`=4